{
	tips:[
          {"freq":1, "tip":"[Industrial.Evolution] After building a Privateer Base, you can help your privateers on a raid to ensure they bring back spoils!"},
          {"freq":1, "tip":"[Industrial.Evolution] A Privateer Base has the potential to output more than any other two industries combined, and can bring back weapons and ship blueprints."},
          {"freq":1, "tip":"[Industrial.Evolution] Privateer Bases cannot target the same system twice in short succession - unless you got a beta core."},
          {"freq":1, "tip":"[Industrial.Evolution] Military Relays are good if you like fortifying a single planet, as their bonus depends on the highest fleet size in the network."},
          {"freq":1, "tip":"[Industrial.Evolution] The Military Relay works as an improved Patrol HQ while there is none on the planet. This makes it ideal as baseline fortification."},
          {"freq":1, "tip":"[Industrial.Evolution] Military Relays have lower build cost and time if there is a Patrol HQ, Military Base, or High Command on a planet."},
          {"freq":1, "tip":"[Industrial.Evolution] Interstellar Relays work as a communications relay for a star system, without needing a stable location."},
          {"freq":1, "tip":"[Industrial.Evolution] Upgrade your Variable Assembler into a Manufactory to increase both exports and monthly commodity deposits."},
          {"freq":1, "tip":"[Industrial.Evolution] All Industrial.Evolution buildings with special outputs will deposit them to the local storage. You can change this in the mod settings.json."},
          {"freq":1, "tip":"[Industrial.Evolution] All Edicts are useful! Using only a single one on all planets is rarely the best course of action."},
          {"freq":1, "tip":"[Industrial.Evolution] Want to grow a new colony fast? Edict: Forced Relocation is your (unethical) new best friend."},
          {"freq":1, "tip":"[Industrial.Evolution] Need a colony to stay under the radar of other factions? Lock the colony at a low size with Edict: Single Child Policy!"},
          {"freq":1, "tip":"[Industrial.Evolution] Massive invasion force headed your way? Edict: Wartime Lockdown turns your planet into a fortress."},
          {"freq":1, "tip":"[Industrial.Evolution] Expensive upkeep breaking your budget? Edict: Forced Labour will make your accountants happy, and your populace unhappy."},
          {"freq":1, "tip":"[Industrial.Evolution] More steam? Edict: Industrial Incentives. Caribbean pirates not included."},
          {"freq":1, "tip":"[Industrial.Evolution] Getting rid of undesirables has never been this easy! Edict: Subpopulation Cleansing - for a limited time only!"},
          {"freq":1, "tip":"[Industrial.Evolution] One colony to rule them all - Edict: Customs Control. There is another Edict to get rid of pesky hobbits."},
          {"freq":1, "tip":"[Industrial.Evolution] No deadline like a hard deadline. Edict: Hard Deadlines - more ships, more budget, more explosions."},
          {"freq":1, "tip":"[Industrial.Evolution] Want to build up a new colony, fast? Edict: Mandated Overtime will double building construction speed - as well as worker burnout."},
          {"freq":1, "tip":"[Industrial.Evolution] Supercomputers are not AI-core space gulags. There is a chance of survival in a gulag."},
          {"freq":1, "tip":"[Industrial.Evolution] Have multiple successful colonies in a system? Consider building a Supercomputer."},
          {"freq":1, "tip":"[Industrial.Evolution] A Centralization Bureau is best built in a system with multiple identical industries."},
          {"freq":1, "tip":"[Industrial.Evolution] Colonized a system with a hostile presence? Build Salvage Yards and rake in those cheap ship parts!"},
          {"freq":1, "tip":"[Industrial.Evolution] Constantly getting invaded, raided or satbombed? Build Salvage Yards and rake in those cheap ship parts!"},
          {"freq":1, "tip":"[Industrial.Evolution] Building two industries with the same output doesn't increase exports - except for the Salvage Yards, which should be built alongside Heavy Industry."},
          {"freq":1, "tip":"[Industrial.Evolution] There are three Academies in the sector: Galatia - Galatian Academy, Hybrasil - Eochu Bres and Westenesse - Fikenhild."},
          {"freq":1, "tip":"[Industrial.Evolution] Academies can change your officers' personality, store both administrators and officers, and increase an administrators skills."},
          {"freq":1, "tip":"[Industrial.Evolution] Ambassadors want to be transported to their office quickly. Your ships are not luxury hotels."},
          {"freq":1, "tip":"[Industrial.Evolution] Industrial.Evolution buildings handle AI core effects different from vanilla, up to total functionality changes. Give it a try!"},
          {"freq":1, "tip":"[Industrial.Evolution] Rule of thumb: If it exports commodities, it needs an industry slot."},
          {"freq":1, "tip":"[Industrial.Evolution] You can find Variable Production Chips (VPC) anywhere you could find a Nanoforge."},
          {"freq":1, "tip":"[Industrial.Evolution] An Academy can only change the personality of an officer once - or twice with an Alpha Core."},
          {"freq":1, "tip":"[Industrial.Evolution] More hostile factions means more hostile planets in a star system, means more spoils if a Privateer Base raids it."},
          {"freq":1, "tip":"[Industrial.Evolution] There are Restoration Docks on some core worlds, offering cheap repairs for D-Mods."},
          {"freq":1, "tip":"[Industrial.Evolution] Pressing F1 on the Restoration Dock Storage shows a cost forecast. You can estimate costs by placing less ships than the docks can repair into the storage."},
          {"freq":1, "tip":"[Industrial.Evolution] Descriptions and text prompts can help you to understand how things work, and what they do. Read them, they are there for a reason."},
          {"freq":1, "tip":"[Industrial.Evolution] Alpha cores in Industrial.Evolution buildings do NOT give you the effects of Gamma or Beta cores!"},
          {"freq":1, "tip":"[Industrial.Evolution] No building added by this mod is useless. It might just not fit your play style, or you didn't read the tooltip."},
          {"freq":1, "tip":"[Industrial.Evolution] The Requisitions Center sells rare weapons more often than other markets. A visit might be worth it!"},
          {"freq":1, "tip":"[Industrial.Evolution] There is only one Requisitions Center in the Sector - on Baetis, Eos Exodus."},
          {"freq":1, "tip":"[Industrial.Evolution] You can set the Requisitions Center to sell only specific faction weapons by building it on a planet with an Embassy."},
          {"freq":1, "tip":"[Industrial.Evolution] Reverse Engineering is best done on the side; Why scrap a ship when you can tow it back to unlock its secrets?"},
          {"freq":1, "tip":"[Industrial.Evolution] Saw a sweet ship you would love to have in your own colony patrols? Reverse engineer the blueprint and make it happen!"},
          {"freq":1, "tip":"[Industrial.Evolution] Reverse Engineering progress depends on hull size and D-mods. Repairing a ship before disassembling it might be worth it."},
          {"freq":1, "tip":"[Industrial.Evolution] You can add ships that are not available for Reverse Engineering to the Whitelist under Industrial.Evolution/data/config/IndEvo."},
          {"freq":1, "tip":"[Industrial.Evolution] This mod is customizable - check out settings.json in the Industrial Evolution mod files."},
          {"freq":1, "tip":"[Industrial.Evolution] Some ancient structures might have effects that are not immediately noticeable."},
          {"freq":1, "tip":"[Industrial.Evolution] Found a strange piece of tech that looks like a blueprint but isn't one? Keep it."},
          {"freq":1, "tip":"[Industrial.Evolution] Planets in systems with [REDACTED] presence might hold more treasures than just the usual."},
          {"freq":1, "tip":"[Industrial.Evolution] Sick of having to transport stuff between colonies all the time? Build a Courier Port, outsource the chores!"},
          {"freq":1, "tip":"[Industrial.Evolution] A courier port can target a specific storage - you can send what you need, where you need it."},
          {"freq":1, "tip":"[Industrial.Evolution] Courier Port can take items from the Stockpile and deliver it to a storage. Build your Waystation somewhere else, have regular shipments to your main colony!"},
          {"freq":1, "tip":"[Industrial.Evolution] If a courier port does not have enough items in for a full shipment, it will send what it can find and adjust the shipment cost accordingly."},
          {"freq":1, "tip":"[Industrial.Evolution] Courier Fleets will never be attacked by anyone, and will never lose anything they are supposed to ship."},
          {"freq":1, "tip":"[Industrial.Evolution] You can manually disable a courier shipment in the shipping port menu."},
          {"freq":1, "tip":"[Industrial.Evolution] Only one Courier port is needed to ship from and to any eligible planet - you do not need a port on every planet."},
          {"freq":1, "tip":"[Industrial.Evolution] You can change where most buildings deliver their output in the settings.json of the mod."},
          {"freq":1, "tip":"[Industrial.Evolution] Found a forge template and don't know what to do? Head towards the more dangerous parts of the sector, and survey the planets there."},
          {"freq":1, "tip":"[Industrial.Evolution] The Salvage Yards unlock the custom order menu, but will most likely build burning piles of trash without Heavy Industry."},
          {"freq":1, "tip":"[Industrial.Evolution] The Salvage Yards take weapons from the industrial storage and converts them to exports and production budget."},
          {"freq":1, "tip":"[Industrial.Evolution] Your ship quality is trash after you built salvage yards? Build heavy industry on the same planet to counteract it!"},
          {"freq":1, "tip":"[Industrial.Evolution] The planet with the highest ship hull exports determines faction wide ship quality. If that is the salvage yards, your patrols will spawn with D-mods. Build heavy industry on the same planet to fix it!"},
          {"freq":1, "tip":"[Industrial.Evolution] Salvage yards without heavy industry on the same planet will have a negative impact on your overall ship quality."},
          {"freq":1, "tip":"[Industrial.Evolution] Establishing a colony on a planet with ruins sometimes yields a nice surprise - if you are lucky."},
          {"freq":1, "tip":"[Industrial.Evolution] Use the Salvage Yards on Agreus to build ships from blueprints without a colony. They even come without serial numbers!"},
          {"freq":1, "tip":"[Industrial.Evolution] Ship Components can be used at a salvage yard to reduce the price of building ships, and Relic Components reduce their D-Mods."},
          {"freq":1, "tip":"[Industrial.Evolution] Salvage Yards can transfer D-Mods between ships of similar size and make."},
          {"freq":1, "tip":"[Industrial.Evolution] You can remove Decivilized Subpopulation with a senate edict - Subpopulation Cleansing. Also works on Lawless Subpopulation."},
          {"freq":1, "tip":"[Industrial.Evolution] The Academy can add skills to your administrators that you can not get anywhere else."},
          {"freq":1, "tip":"[Industrial.Evolution] With an Academy, you are almost guaranteed to find hireable officers and admins at the planet. They sometimes even have special skills!"},
          {"freq":1, "tip":"[Industrial.Evolution] The only public Restoration Dock with a Beta Core is in Hybrasil, on Culann. There are a few with Gamma Cores."},
          {"freq":1, "tip":"[Industrial.Evolution] Three public Salvage Yards exist - Hybrasil – Donn, Westenesse - Suddene, and Arcadia - Agreus."},
          {"freq":1, "tip":"[Industrial.Evolution] What use do world symbols have, you ask? What, you don't want to build yourself a palace while your populace starves? ...Yeah, that's what I thought."},
          {"freq":1, "tip":"[Industrial.Evolution] Build a memorial for all those crewmen you murdered! They had a family too, you know? They might visit, it's good for tourism."},
          {"freq":1, "tip":"[Industrial.Evolution] The Forum Post for this mod has an FAQ section for each building. Reading it can be worthwhile if you have questions."},
          {"freq":1, "tip":"[Industrial.Evolution] You can disable the tips from this mod by going to Industrial.Evolution/data/strings and deleting the file tips.json"},
          {"freq":1, "tip":"[Industrial.Evolution] Salvage Event descriptions will change slightly to give you an indication of your chances. Read them!"},
          {"freq":1, "tip":"[Industrial.Evolution] A station blew up in your face when you took the Nanoforge? Reading the event description can hint at the risk, and help to avoid that."},
          {"freq":1, "tip":"[Industrial.Evolution] Going slow, or having a small fleet when going through minefields will reduce your chance of blowing up."},
          {"freq":1, "tip":"[Industrial.Evolution] You have to pass a minefield, but keep blowing up? Try making a detachment, leave the heavy ships in orbit, and go slow."},
          {"freq":1, "tip":"[Industrial.Evolution] Detachments can help with stealth missions. Leave the Onslaught in a belt and sneak in with a frigate - Han Solo had a small ship for a reason."},
          {"freq":1, "tip":"[Industrial.Evolution] A station blew up in your face when you took the Nanoforge? Reading the event description can indicate how likely your crew is to diffuse the bomb."},
          {"freq":1, "tip":"[Industrial.Evolution] Building a World Wonder will reward a story point - once. Building it a second time on the same planet, however, will not."},
          {"freq":1, "tip":"[Industrial.Evolution] More Galatia Academy Research Projects will unlock once you find a certain type of exotic weapon."},
          {"freq":1, "tip":"[Industrial.Evolution] Supercomputers stack with diminishing returns. If you have two very cold planets in one system, it might actually be worth it to build two."},
          {"freq":1, "tip":"[Industrial.Evolution] The centralisation bureau increases the output of industries on the planet it is built on, not the duplicates you built on other planets."},

          #memes - show up with lower frequency compared to actual tips,
          {"freq":0.1, "tip":"[Industrial.Evolution] Orbital Works is Vanilla, not Industrial.Evolution. How anyone can get that one wrong is beyond me."},
          {"freq":0.1, "tip":"[Industrial.Evolution] The only mod to encourage gambling addiction! Roll that Galatian Academy Gacha for more stuff you don't need!"},
          {"freq":0.1, "tip":"[Industrial.Evolution] Fighting against tooltip-illiteracy since 2019, and losing."},
          {"freq":0.1, "tip":"[Industrial.Evolution] Variable Assemblers can act as a resupply point in fringe colonies. Which you never build anyway. You are a boring person."},
          {"freq":0.1, "tip":"[Industrial.Evolution] There are zero easter eggs in this mod, and none have anything to do with drifting cars."},
          {"freq":0.5, "tip":"[Industrial.Evolution] Kletka Simulators are from Terraforming & Station Construction, NOT Industrial Evolution."},
          {"freq":0.5, "tip":"[Industrial.Evolution] The Chamelion building is also from Terraforming & Station Construction."},
          {"freq":0.1, "tip":"[Industrial.Evolution] Rule of thumb: If you understand what a building does at first glance, it's probably not from Industrial Evolution."},
          {"freq":0.1, "tip":"[Industrial.Evolution] You can sort your storage with the tabs on top of the item window. This will not solve your neurotic hoarding problem. You should get some help."},
          {"freq":0.5, "tip":"[Industrial.Evolution] This is a reminder that you do not need 500 Vulcan Cannons. Feed them to the Salvage Yards instead."},
          {"freq":0.1, "tip":"[Industrial.Evolution] Weapon stacks have a cap. But you knew that already, didn't you?"},
          {"freq":0.1, "tip":"[Industrial.Evolution] Void Extraction is from Legacy of Arkgneisis, not Industrial.Evolution. Although I'll concede that it's a good one."},
          {"freq":0.1, "tip":"[Industrial.Evolution] Spacing an Ambassador is a very good idea and has no consequences at all."},
          {"freq":0.1, "tip":"[Industrial.Evolution] Did you know that you could, in theory, sell an ambassador on the open market? It's a risk-free transaction!"},
    ],
}